tap 'homebrew/cask'
tap 'homebrew/cask-versions'

brew 'autojump'
brew 'bat'
brew 'fish'
brew 'neovim'
brew 'poetry'
brew 'python'
brew 'ripgrep'
brew 'tig'
brew 'tmux'
brew 'tree-sitter'

{{ if eq .chezmoi.os "darwin" -}}
        cask '1password'
        cask 'dash'
        cask 'docker'
        cask 'iterm2'
        cask 'obsidian'
        cask 'rectangle'
        cask 'spotify'
        cask 'signal'
{{end -}}
