brew 'autojump'
brew 'bat'
brew 'fish'
brew 'lua-language-server'
brew 'neovim'
brew 'poetry'
brew 'pyright'
brew 'python'
brew 'ripgrep'
brew 'rust-analyzer'
brew 'starship'
brew 'tig'
brew 'tmux'
brew 'tree-sitter'
{{ if eq .chezmoi.os "darwin" -}}
        tap 'homebrew/cask'
        tap 'homebrew/cask-versions'
        tap 'homebrew/cask-fonts'

        cask 'alacritty'
        cask 'dash'
        cask 'obsidian'
        cask 'rectangle'
        cask 'signal'
        cask 'spotify'

        # TODO - figure out a way to avoid hard-coding font
        cask 'font-fira-code-nerd-font'
{{end -}}
