tap 'homebrew/cask'
tap 'homebrew/cask-versions'


brew 'autojump'
brew 'bat'
brew 'curl'
brew 'fisher'
brew 'git'
brew 'neovim'
brew 'poetry'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'python@3.9'
brew 'romkatv/powerlevel10k/powerlevel10k'
brew 'ripgrep'
brew 'tig'
brew 'tmux'
brew 'tree-sitter'
brew 'zsh'

cask '1password'
cask 'dash'
cask 'docker'
cask 'iterm2'
cask 'obsidian'
cask 'rectangle'
cask 'spotify'
cask 'signal'
